//TIP To <b>Run</b> code, press <shortcut actionId="Run"/> or
// click the <icon src="AllIcons.Actions.Execute"/> icon in the gutter.
public class Main {
    public static void main(String[] args) {

    }
}


//Задание 1
//Создайте базовый класс Animal с методом sound(), который выводит "Звук животного". Затем создайте два дочерних класса Dog и Cat, каждый из которых переопределяет метод sound() для вывода "Гав" и "Мяу" соответственно.
//
//        Задание 2
//Создайте базовый класс Vehicle с  полями make и model и методом displayInfo(). Создайте дочерние классы Car и Bike, которые добавляют специфические  полеы и переопределяют метод displayInfo().
//
//Задание 3
//Создайте базовый класс Person с  полями name и age. Затем создайте дочерний класс Student, который добавляет  поле grade и метод study(), выводящий "Студент учится".
//
//Задание 4
//Создайте класс Shape с методом area(), который возвращает 0. Затем создайте дочерние классы Rectangle и Circle, которые переопределяют метод area() для расчета площади прямоугольника и круга соответственно.
//
//Задание 5
//Создайте базовый класс Employee с  полями name и salary, а также методом work(), выводящим "Работник работает". Создайте дочерний класс Manager, который добавляет  поле department и переопределяет метод work() для вывода "Менеджер управляет".